hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_master_driver.c
                if (dspiState->remainingReceiveByteCount == 0)
                {
                    break;
                }
            } /* End of RX FIFO drain while loop */
        }
        /* Optimized for bits/frame less than or equal to one byte. */
        else
        {
            while (DSPI_HAL_GetStatusFlag(baseAddr, kDspiRxFifoDrainRequest))
            {
                wordReceived = DSPI_HAL_ReadData(baseAddr);
                /* clear the rx fifo drain request, needed for non-DMA applications as this flag
                 * will remain set even if the rx fifo is empty. By manually clearing this flag, it
                 * either remain clear if no more data is in the fifo, or it will set if there is
                 * more data in the fifo.
                 */
                DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoDrainRequest);

                /* Store read bytes into rx buffer only if a buffer pointer was provided */
                if(dspiState->receiveBuffer)
                {
                    *dspiState->receiveBuffer = wordReceived;
                    ++dspiState->receiveBuffer;
                }

                --dspiState->remainingReceiveByteCount;

                if (dspiState->remainingReceiveByteCount == 0)
                {
                    break;
                }
            } /* End of RX FIFO drain while loop */
        }
    }

    /* Check write buffer. We always have to send a word in order to keep the transfer
     * moving. So if the caller didn't provide a send buffer, we just send a zero.
     */
    if (dspiState->remainingSendByteCount)
    {
        DSPI_DRV_MasterFillupTxFifo(instance);
    }

    /* Check if we're done with this transfer.*/
    if ((dspiState->remainingSendByteCount == 0) && (dspiState->remainingReceiveByteCount == 0))
    {
        /* Complete the transfer and disable the interrupts */
        DSPI_DRV_MasterCompleteTransfer(instance);
    }
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

